bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21J15A.PIC
      <edc:SFRDef edc:_addr="0x42001CF8" edc:access="---------------------------nnnnn" edc:cname="TXEFA" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFAI" edc:desc="Event FIFO Acknowledge Index" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42001CFC" edc:offset="0x304"/>
      <edc:SFRDef edc:_addr="0x42002000" edc:access="rrrrrrrrrrrr--------------------" edc:cname="CREL" edc:impl="0xFFF00000" edc:mclr="00110010000100000000000000000000" edc:nzwidth="0x20" edc:por="00110010000100000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="SUBSTEP" edc:desc="Sub-step of Core Release" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="STEP" edc:desc="Step of Core Release" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REL" edc:desc="Core Release" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002004" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ENDN" edc:mclr="10000111011001010100001100100001" edc:nzwidth="0x20" edc:por="10000111011001010100001100100001" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="ETV" edc:desc="Endianness Test Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002008" edc:access="------------------------------nn" edc:cname="MRCFG" edc:impl="0x3" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="QOS" edc:desc="Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200200C" edc:access="--------n--nnnnn---nnnnnnnnnnnnn" edc:cname="DBTP" edc:impl="0x9F1FFF" edc:mclr="00000000000000000000101000110011" edc:nzwidth="0x20" edc:por="00000000000000000000101000110011" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="DSJW" edc:desc="Data (Re)Synchronization Jump Width" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DTSEG2" edc:desc="Data time segment after sample point" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DTSEG1" edc:desc="Data time segment before sample point" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DBRP" edc:desc="Data Baud Rate Prescaler" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TDC" edc:desc="Tranceiver Delay Compensation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002010" edc:access="------------------------nnnn----" edc:cname="TEST" edc:impl="0xF0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LBCK" edc:desc="Loop Back Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TX" edc:desc="Control of Transmit Pin" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CORE" edc:desc="TX controlled by CAN core" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SAMPLE" edc:desc="TX monitoring sample point" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DOMINANT" edc:desc="Dominant (0) level at pin CAN_TX" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RECESSIVE" edc:desc="Recessive (1) level at pin CAN_TX" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RX" edc:desc="Receive Pin" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002014" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="RWD" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="WDC" edc:desc="Watchdog Configuration" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="WDV" edc:desc="Watchdog Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002018" edc:access="----------------nnnn--nnnnnnnnnn" edc:cname="CCCR" edc:impl="0xF3FF" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="INIT" edc:desc="Initialization" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCE" edc:desc="Configuration Change Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASM" edc:desc="ASM Restricted Operation Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSA" edc:desc="Clock Stop Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:desc="Clock Stop Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON" edc:desc="Bus Monitoring Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAR" edc:desc="Disable Automatic Retransmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEST" edc:desc="Test Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FDOE" edc:desc="FD Operation Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSE" edc:desc="Bit Rate Switch Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PXHD" edc:desc="Protocol Exception Handling Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFBI" edc:desc="Edge Filtering during Bus Integration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXP" edc:desc="Transmit Pause" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NISO" edc:desc="Non ISO Operation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200201C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:cname="NBTP" edc:impl="0xFFFFFF7F" edc:mclr="00000110000000000000101000000011" edc:nzwidth="0x20" edc:por="00000110000000000000101000000011" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="NTSEG2" edc:desc="Nominal Time segment after sample point" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NTSEG1" edc:desc="Nominal Time segment before sample point" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NBRP" edc:desc="Nominal Baud Rate Prescaler" edc:nzwidth="0x9"/>
            <edc:SFRFieldDef edc:cname="NSJW" edc:desc="Nominal (Re)Synchronization Jump Width" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
